TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_comp.h
    return (DL_COMP_DAC_CONTROL)(control);
}

/**
 *  @brief      Set whether DACCODE0 or DACCODE1 is the input to the DAC
 *
 * @pre The DACCTL bit must be set to 1 in order to program the DACSW bit to
 * select between DACCODE0 or DACCODE1.
 *
 * @sa          DL_COMP_setDACControl
 *
 *  @param[in]  comp   Pointer to the register overlay for the peripheral
 *  @param[in]  input  The input to the DAC. One of @ref DL_COMP_DAC_INPUT
 */
__STATIC_INLINE void DL_COMP_setDACInput(
    COMP_Regs *comp, DL_COMP_DAC_INPUT input)
{
    DL_Common_updateReg(&comp->CTL2, (uint32_t) input, COMP_CTL2_DACSW_MASK);
}

/**
 *  @brief      Get whether DACCODE0 or DACCODE1 is the input to the DAC
 *
 * @pre The DACCTL bit must be set to 1 in order to program the DACSW bit to
 * select between DACCODE0 or DACCODE1.
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 *
 *  @return     The input to the DAC
 *
 *  @retval     One of @ref DL_COMP_DAC_INPUT
 */
__STATIC_INLINE DL_COMP_DAC_INPUT DL_COMP_getDACInput(COMP_Regs *comp)
{
    uint32_t input = (comp->CTL2 & COMP_CTL2_DACSW_MASK);

    return (DL_COMP_DAC_INPUT)(input);
}

/**
 *  @brief      Set the 8-bit DAC input code through DACCODE0
 *
 * Sets the first 8-bit DAC code through DACCODE0.  When the DAC code is 0x0
 * the DAC output will be selected reference voltage x 1/256 V. When the DAC
 * code is 0xFF the DAC output will be selected reference voltage x 255/256.
 *
 * @pre The DACCTL bit determines what controls the selection between
 * DACCODE0 and DACCODE1.
 * @pre If DACCTL is 1, then the DACSW bit is used to select between DACCODE0
 * or DACCODE1.
 *
 * @sa          DL_COMP_setDACControl
 * @sa          DL_COMP_setDACInput
 *
 *  @param[in]  comp   Pointer to the register overlay for the peripheral
 *  @param[in]  value  Code to set for codeDACCODE0.
 *                     Value between 0x0 - 0xFF.
 */
__STATIC_INLINE void DL_COMP_setDACCode0(COMP_Regs *comp, uint32_t value)
{
    DL_Common_updateReg(&comp->CTL3, value, COMP_CTL3_DACCODE0_MASK);
}

/**
 *  @brief      Get the code value of DACCODE0
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 *
 *  @return     The code value that DACCODE0 is set to
 *
 *  @retval     Value between 0x0 - 0xFF
 */
__STATIC_INLINE uint32_t DL_COMP_getDACCode0(COMP_Regs *comp)
{
    return (comp->CTL3 & COMP_CTL3_DACCODE0_MASK);
}

/**
 *  @brief      Set the 8-bit DAC input code through DACCODE1
 *
 * Sets the second 8-bit DAC code through DACCODE1.  When the DAC code is 0x0
 * the DAC output will be selected reference voltage x 1/256 V. When the DAC
 * code is 0xFF the DAC output will be selected reference voltage x 255/256.
 *
 * @pre The DACCTL bit determines what controls the selection between
 * DACCODE0 and DACCODE1.
 * @pre If DACCTL is 1, then the DACSW bit is used to select between DACCODE0
 * or DACCODE1.
 *
 * @sa          DL_COMP_setDACControl
 * @sa          DL_COMP_setDACInput
 *
 *  @param[in]  comp   Pointer to the register overlay for the peripheral
 *  @param[in]  value  Code to set for codeDACCODE1.
 *                     Value between 0x0 - 0xFF.
 */
__STATIC_INLINE void DL_COMP_setDACCode1(COMP_Regs *comp, uint32_t value)
{
    DL_Common_updateReg(&comp->CTL3, (value << COMP_CTL3_DACCODE1_OFS),
        COMP_CTL3_DACCODE1_MASK);
}

/**
 *  @brief      Get the code value of DACCODE1
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 *
 *  @return     The code value that DACCODE1 is set to
 *
 *  @retval     Value between 0x0 - 0xFF
 */
__STATIC_INLINE uint32_t DL_COMP_getDACCode1(COMP_Regs *comp)
{
    return ((comp->CTL3 & COMP_CTL3_DACCODE1_MASK) >> COMP_CTL3_DACCODE1_OFS);
}

/**
 *  @brief      Gets the comparator output
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the output status of the comparator. One of @ref DL_COMP_OUTPUT
 */
__STATIC_INLINE DL_COMP_OUTPUT DL_COMP_getComparatorOutput(COMP_Regs *comp)
{
    uint32_t output = (comp->STAT & COMP_STAT_OUT_MASK);

    return (DL_COMP_OUTPUT)(output);
}

/**
 *  @brief      Enable sampled mode of the comparator
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_COMP_enableSampledMode(COMP_Regs *comp)
{
    comp->CTL2 |= COMP_CTL2_SAMPMODE_ENABLE;
}

/**
 *  @brief      Checks if sampled mode is enabled
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns if sampled mode is enabled
 *
 *  @retval     true  Sampled mode is enabled
 *  @retval     false Sampled mode is disabled

 */
__STATIC_INLINE bool DL_COMP_isSampledModeEnabled(COMP_Regs *comp)
{
    return (
        (comp->CTL2 & COMP_CTL2_SAMPMODE_MASK) == COMP_CTL2_SAMPMODE_ENABLE);
}

/**
 *  @brief      Disable sampled mode
 *
 *  @param[in]  comp  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_COMP_disableSampledMode(COMP_Regs *comp)
{
    comp->CTL2 &= ~(COMP_CTL2_SAMPMODE_MASK);
}

/**
 *  @brief Sets the event subscriber channel id
 *
 *  @param[in]  comp Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_COMP_setSubscriberChanID(
    COMP_Regs *comp, DL_COMP_SUBSCRIBER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &comp->FSUB_0;

    *(pReg + (uint32_t) index) = (chanID & COMP_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event subscriber channel id
 *
 *  @param[in]  comp Pointer to the register overlay for the peripheral
 *  @param[in]  index  Specifies the register event index to be configured
 *
 *  @return     Event subscriber channel ID
 *
 */
__STATIC_INLINE uint8_t DL_COMP_getSubscriberChanID(
    COMP_Regs *comp, DL_COMP_SUBSCRIBER_INDEX index)
{
    volatile uint32_t *pReg = &comp->FSUB_0;

    return ((uint8_t)(*(pReg + (uint32_t) index) & COMP_FSUB_0_CHANID_MASK));
}

/**
 *  @brief      Enable COMP interrupts
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 */
__STATIC_INLINE void DL_COMP_enableInterrupt(
    COMP_Regs *comp, uint32_t interruptMask)
{
    comp->INT_EVENT[0].IMASK |= interruptMask;
}

/**
 *  @brief      Disable COMP interrupts
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 */
__STATIC_INLINE void DL_COMP_disableInterrupt(
    COMP_Regs *comp, uint32_t interruptMask)
{
    comp->INT_EVENT[0].IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which COMP interrupts are enabled
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 *
 *  @return     Which of the requested COMP interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_COMP_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_COMP_getEnabledInterrupts(
    COMP_Regs *comp, uint32_t interruptMask)
{
    return (comp->INT_EVENT[0].IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled COMP interrupts
 *
 *  Checks if any of the COMP interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 *
 *  @return     Which of the requested COMP interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_COMP_INTERRUPT values
 *
 *  @sa         DL_COMP_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_COMP_getEnabledInterruptStatus(
    COMP_Regs *comp, uint32_t interruptMask)
{
    return (comp->INT_EVENT[0].MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any COMP interrupt
 *
 *  Checks if any of the COMP interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 *
 *  @return     Which of the requested COMP interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_COMP_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_COMP_getRawInterruptStatus(
    COMP_Regs *comp, uint32_t interruptMask)
{
    return (comp->INT_EVENT[0].RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending COMP interrupt
 *
 *  Checks if any of the COMP interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @return     The highest priority pending COMP interrupt. One of @ref
 *               DL_COMP_IIDX
 */
__STATIC_INLINE DL_COMP_IIDX DL_COMP_getPendingInterrupt(COMP_Regs *comp)
{
    return (DL_COMP_IIDX)(comp->INT_EVENT[0].IIDX);
}

/**
 *  @brief      Clear pending COMP interrupts
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_COMP_INTERRUPT.
 */
__STATIC_INLINE void DL_COMP_clearInterruptStatus(
    COMP_Regs *comp, uint32_t interruptMask)
{
    comp->INT_EVENT[0].ICLR = interruptMask;
}

/**
 *  @brief Sets the COMP event publisher channel ID
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  chanID         Channel ID number. Valid range 0-15.
 *                             If ChanID == 0, publisher is disconnected.
 */
__STATIC_INLINE void DL_COMP_setPublisherChanID(
    COMP_Regs *comp, uint8_t chanID)
{
    comp->FPUB_1 = (chanID & COMP_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel ID
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_COMP_getPublisherChanID(COMP_Regs *comp)
{
    return ((uint8_t)((comp->FPUB_1) & COMP_FPUB_1_CHANID_MAXIMUM));
}

/**
 *  @brief      Enable COMP event
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 */
__STATIC_INLINE void DL_COMP_enableEvent(COMP_Regs *comp, uint32_t eventMask)
{
    comp->INT_EVENT[1].IMASK |= (eventMask);
}

/**
 *  @brief      Disable COMP event
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 */
__STATIC_INLINE void DL_COMP_disableEvent(COMP_Regs *comp, uint32_t eventMask)
{
    comp->INT_EVENT[1].IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which COMP events are enabled
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 *
 *  @return     Which of the requested COMP interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_COMP_EVENT values
 */
__STATIC_INLINE uint32_t DL_COMP_getEnabledEvents(
    COMP_Regs *comp, uint32_t eventMask)
{
    return ((comp->INT_EVENT[1].IMASK) & (eventMask));
}

/**
 *  @brief      Check event flag of enabled COMP event
 *
 *  Checks if any of the COMP events that were previously enabled are
 *  pending.
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 *
 *  @return     Which of the requested COMP interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_COMP_EVENT values
 *
 *  @sa         DL_COMP_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_COMP_getEnabledEventStatus(
    COMP_Regs *comp, uint32_t eventMask)
{
    return ((comp->INT_EVENT[1].MIS) & eventMask);
}

/**
 *  @brief      Check interrupt flag of any COMP event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 *
 *  @return     Which of the requested COMP interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_COMP_EVENT values
 */
__STATIC_INLINE uint32_t DL_COMP_getRawEventsStatus(
    COMP_Regs *comp, uint32_t eventMask)
{
    return ((comp->INT_EVENT[1].RIS) & eventMask);
}

/**
 *  @brief      Clear pending COMP events
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_COMP_EVENT.
 */
__STATIC_INLINE void DL_COMP_clearEventsStatus(
    COMP_Regs *comp, uint32_t eventMask)
{
    comp->INT_EVENT[1].ICLR |= (eventMask);
}

#ifdef DEVICE_HAS_ANALOG_COMPARISION_WAKEUP_MODE
/**
 *  @brief      Enable Analog comparision wake-up
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_COMP_enableAnalogCompareWakeup(
    COMP_Regs *comp)
{
    comp->ANACMPWKUPCTL |= (uint32_t)(COMP_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK);
}

/**
 *  @brief      Disable Analog comparision wake-up
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_COMP_disableAnalogCompareWakeup(
    COMP_Regs *comp)
{
    comp->ANACMPWKUPCTL &= ~((uint32_t)(COMP_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK));
}

/**
 *  @brief      Get Analog comparision wake-up status
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @return                    Wakeup mode enabled or not
 */
__STATIC_INLINE uint32_t DL_COMP_isAnalogCompareWakeupEnabled(
    COMP_Regs *comp)
{
    return ((comp->ANACMPWKUPCTL) & COMP_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK);
}

/**
 *  @brief      Set Analog wake-up blanking and comparision period
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @param[in]  period         Blanking and comparision period (8-bit 
 *                             value)
 */
__STATIC_INLINE void DL_COMP_setAnalogWakeupBlankingComparisionPeriod(
    COMP_Regs *comp, uint8_t period)
{
    comp->ANACMPCTRCTL |= ((uint32_t)(period & COMP_ANACMPCTRCTL_BLKCMPPRD_MASK));
}

/**
 *  @brief      Set Analog wake-up comparision period
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @param[in]  period         Comparision period (4-bit value)
 */
__STATIC_INLINE void DL_COMP_setAnalogWakeupComparisionPeriod(
    COMP_Regs *comp, uint8_t period)
{
    comp->ANACMPCTRCTL |= ((uint32_t)((period << COMP_ANACMPCTRCTL_CMPPRD_OFS) & COMP_ANACMPCTRCTL_CMPPRD_MASK));
}

/**
 *  @brief      Get Analog wake-up blanking and comparision period
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @return                    Blanking and comparision period (8-bit 
 *                             value)
 */
__STATIC_INLINE uint8_t DL_COMP_getAnalogWakeupBlankingComparisionPeriod(
    COMP_Regs *comp)
{
    return(uint8_t)(comp->ANACMPCTRCTL & COMP_ANACMPCTRCTL_BLKCMPPRD_MASK);
}

/**
 *  @brief      Get Analog wake-up comparision period
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @return                    Comparision period (4-bit value)
 */
__STATIC_INLINE uint8_t DL_COMP_getAnalogWakeupComparisionPeriod(
    COMP_Regs *comp)
{
    return(uint8_t)((comp->ANACMPCTRCTL & COMP_ANACMPCTRCTL_CMPPRD_MASK) >> COMP_ANACMPCTRCTL_CMPPRD_OFS);
}

/**
 *  @brief      Get Analog wake-up input event status
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *
 *  @param[in]  input          Input Channel whose status to be returned
 * 
 *  @return                    Status if the input channel caused event
 */
__STATIC_INLINE uint32_t DL_COMP_getAnalogWakeupInputEventStatus(
    COMP_Regs *comp, DL_COMP_ANACMPINPUT input)
{
    return (uint32_t)(comp->ANACMPCHSTS & (COMP_ANACMPCHSTS_IN0EVT_MASK << input));
}

/**
 *  @brief      Clear Analog wake-up input event status
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *
 *  @param[in]  input          Input Channel whose status to be cleared
 */
__STATIC_INLINE void DL_COMP_clearAnalogWakeupInputEventStatus(
    COMP_Regs *comp, DL_COMP_ANACMPINPUT input)
{
    comp->ANACMPCHSTSCLR |= ((uint32_t)(COMP_ANACMPCHSTSCLR_IN0EVTCLR_MASK << input));
}

/**
 *  @brief      Set Analog wake-up daccode
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @param[in]  daccode        Daccode value (8-bit value)
 * 
 *  @param[in]  input          Daccode number
 */
__STATIC_INLINE void DL_COMP_setAnalogWakeupDaccode(
    COMP_Regs *comp, uint8_t daccode, DL_COMP_ANACMPINPUT input)
{
    comp->ANACMPDACCODE |= ((uint32_t)(daccode & COMP_ANACMPDACCODE_IP0DACCODE_MASK) << (input * COMP_ANACMPDACCODE_IP1DACCODE_OFS));
}

/**
 *  @brief      Get Analog wake-up daccode
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 * 
 *  @param[in]  input          Daccode number
 * 
 *  @return                    Daccode value (8-bit value)
 */
__STATIC_INLINE uint8_t DL_COMP_getAnalogWakeupDaccode(
    COMP_Regs *comp, DL_COMP_ANACMPINPUT input)
{
    return (uint8_t)((comp->ANACMPDACCODE & (COMP_ANACMPDACCODE_IP0DACCODE_MASK << (input * COMP_ANACMPDACCODE_IP1DACCODE_OFS))) >> (input * COMP_ANACMPDACCODE_IP1DACCODE_OFS));
}

/**
 *  @brief      Enable Analog wake-up window comparision mode
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_COMP_enableAnalogWakeupWindowComparatorMode(
    COMP_Regs *comp)
{
    comp->ANACMPWD |= (uint32_t)(COMP_ANACMPWD_WDEN_MASK);
}

/**
 *  @brief      Disable Analog wake-up window comparision mode
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_COMP_disableAnalogWakeupWindowComparatorMode(
    COMP_Regs *comp)
{
    comp->ANACMPWD &= ~(uint32_t)(COMP_ANACMPWD_WDEN_MASK);
}

/**
 *  @brief      Input selection for Analog wake-up window comparision mode
 *
 *  @param[in]  comp           Pointer to the register overlay for the
 *                             peripheral
 *
 *  @param[in]  input          Input Channel selection
 */
__STATIC_INLINE void DL_COMP_setAnalogWakeupWindowComparatorInput(
    COMP_Regs *comp, DL_COMP_ANACMPINPUT input)
{
    comp->ANACMPWD |= (uint32_t)((input << COMP_ANACMPWD_INMUXSEL_WD_OFS) & COMP_ANACMPWD_INMUXSEL_WD_MASK);
}

#endif

/* clang-format on */

#ifdef __cplusplus
}
#endif

#endif /* __MSP_HAS_COMP__ */

#endif /* ti_dl_dl_comp__include */
/** @}*/